app/views/posts/index.html.erb

SELECT COUNT(*) FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 22]]
---
        <% end %>
        <% if post.replies.count == 0 %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
        <% if post.replies.count > 1 %>
          <small>by <%= post.user.username %> with <%= post.replies.count %> replies since <%= post.created_at.to_date %></small>