app/views/posts/show.html.erb

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
---
<h3 style="margin-left: 3px;">Replies</h3>
<% if @post.replies.blank? %>