app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at DESC')
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)