app/controllers/replies_controller.rb

      def create
        @post = Post.find(params[:post_id])
        @reply = @post.replies.create(params[:reply].permit(:user_id, :body))
        @reply.user_id=current_user.id if current_user
        @reply.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "replies" ("author", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "daniel"], ["body", "hello, this is a reply"], ["post_id", 1], ["created_at", "2017-12-05 00:01:31.497742"], ["updated_at", "2017-12-05 00:01:31.497742"]]
UPDATE "replies" SET "user_id" = ?, "updated_at" = ? WHERE "replies"."id" = ?  [["user_id", 8], ["updated_at", "2017-12-08 18:01:56.835563"], ["id", 2]]