app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "me"], ["password", "pass"], ["created_at", "2017-12-06 21:23:38.801188"], ["updated_at", "2017-12-06 21:23:38.801188"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "bobby0"], ["encrypted_password", "$2a$11$/oPTKOpEAcAuCx2deqsz8.rWcDUL459RQUhqYrcOdIQbbN5xpNDu2"], ["updated_at", "2017-12-08 13:49:01.839237"], ["id", 5]]